# SERIES

In [1]:
import pandas as pd
import numpy as np

In [2]:
obj=pd.Series([2,4,6,7,8,9])

In [3]:
obj

0    2
1    4
2    6
3    7
4    8
5    9
dtype: int64

In [4]:
a=obj.values

In [5]:
a

array([2, 4, 6, 7, 8, 9], dtype=int64)

In [6]:
obj.index

RangeIndex(start=0, stop=6, step=1)

In [7]:
b=pd.Series([3,4,5,6,73,66,8,84],index=range(1,16,2))

In [8]:
b

1      3
3      4
5      5
7      6
9     73
11    66
13     8
15    84
dtype: int64

In [9]:
b.index

RangeIndex(start=1, stop=16, step=2)

In [10]:
b[3]

4

In [11]:
b[[1,3,5,7,9]]

1     3
3     4
5     5
7     6
9    73
dtype: int64

In [12]:
b[b>0]

1      3
3      4
5      5
7      6
9     73
11    66
13     8
15    84
dtype: int64

In [13]:
b*2

1       6
3       8
5      10
7      12
9     146
11    132
13     16
15    168
dtype: int64

In [14]:
b

1      3
3      4
5      5
7      6
9     73
11    66
13     8
15    84
dtype: int64

In [15]:
np.square(b)

1        9
3       16
5       25
7       36
9     5329
11    4356
13      64
15    7056
dtype: int64

In [16]:
2 in b

False

In [17]:
3 in b

True

In [18]:
66 in b

False

In [19]:
v=dict(b)

In [20]:
v

{1: 3, 3: 4, 5: 5, 7: 6, 9: 73, 11: 66, 13: 8, 15: 84}

In [21]:
s=pd.Series(v,index=[1,5,7,9,"s"])

In [22]:
s

1     3.0
5     5.0
7     6.0
9    73.0
s     NaN
dtype: float64

In [23]:
b

1      3
3      4
5      5
7      6
9     73
11    66
13     8
15    84
dtype: int64

In [24]:
b.name="population"

In [25]:
b

1      3
3      4
5      5
7      6
9     73
11    66
13     8
15    84
Name: population, dtype: int64

In [26]:
b.index.name="num"

In [27]:
b

num
1      3
3      4
5      5
7      6
9     73
11    66
13     8
15    84
Name: population, dtype: int64

# DATA FRAME

In [28]:
data={'state':['ohia','ohia','ohia','nevada','nevada','nevada'],'year':[2000,2001,2002,2000,2002,2003],'pop':[1.5,1.7,3.6,2.4,2.9,3.2]}

In [29]:
frame=pd.DataFrame(data)

In [30]:
frame.index.name='recod'

In [31]:
frame

        state  year  pop
recod
0        ohia  2000  1.5
1        ohia  2001  1.7
2        ohia  2002  3.6
3      nevada  2000  2.4
4      nevada  2002  2.9
5      nevada  2003  3.2

In [32]:
frame.head()

        state  year  pop
recod
0        ohia  2000  1.5
1        ohia  2001  1.7
2        ohia  2002  3.6
3      nevada  2000  2.4
4      nevada  2002  2.9

In [33]:
frame2=pd.DataFrame(data,columns=['year',"state",'pop'],index=['a','b','c','d','e','f'])

In [34]:
frame2.name='record'

In [35]:
frame2

   year   state  pop
a  2000    ohia  1.5
b  2001    ohia  1.7
c  2002    ohia  3.6
d  2000  nevada  2.4
e  2002  nevada  2.9
f  2003  nevada  3.2

In [36]:
frame2.columns

Index(['year', 'state', 'pop'], dtype='object')

In [37]:
frame2['state']

a      ohia
b      ohia
c      ohia
d    nevada
e    nevada
f    nevada
Name: state, dtype: object

In [38]:
frame2['state']['b']

'ohia'

In [39]:
frame2.state

a      ohia
b      ohia
c      ohia
d    nevada
e    nevada
f    nevada
Name: state, dtype: object

In [40]:
frame2.loc['a']

year     2000
state    ohia
pop       1.5
Name: a, dtype: object

In [41]:
frame2['dept']=6

In [42]:
frame2

   year   state  pop  dept
a  2000    ohia  1.5     6
b  2001    ohia  1.7     6
c  2002    ohia  3.6     6
d  2000  nevada  2.4     6
e  2002  nevada  2.9     6
f  2003  nevada  3.2     6

In [43]:
frame2.dept=np.arange(6)

In [44]:
frame2

   year   state  pop  dept
a  2000    ohia  1.5     0
b  2001    ohia  1.7     1
c  2002    ohia  3.6     2
d  2000  nevada  2.4     3
e  2002  nevada  2.9     4
f  2003  nevada  3.2     5

In [45]:
del frame2['dept']

In [46]:
frame2

   year   state  pop
a  2000    ohia  1.5
b  2001    ohia  1.7
c  2002    ohia  3.6
d  2000  nevada  2.4
e  2002  nevada  2.9
f  2003  nevada  3.2

In [47]:
frame2['eastern']=frame2.state=='ohia'

In [48]:
frame2

   year   state  pop  eastern
a  2000    ohia  1.5     True
b  2001    ohia  1.7     True
c  2002    ohia  3.6     True
d  2000  nevada  2.4    False
e  2002  nevada  2.9    False
f  2003  nevada  3.2    False

In [49]:
o=frame2['eastern']

In [50]:
o

a     True
b     True
c     True
d    False
e    False
f    False
Name: eastern, dtype: bool

In [51]:
m=frame2.values

In [52]:
m

array([[2000, 'ohia', 1.5, True],
       [2001, 'ohia', 1.7, True],
       [2002, 'ohia', 3.6, True],
       [2000, 'nevada', 2.4, False],
       [2002, 'nevada', 2.9, False],
       [2003, 'nevada', 3.2, False]], dtype=object)

In [53]:
pd.DataFrame(m,columns=['year','state','pop','eastern'])

   year   state  pop eastern
0  2000    ohia  1.5    True
1  2001    ohia  1.7    True
2  2002    ohia  3.6    True
3  2000  nevada  2.4   False
4  2002  nevada  2.9   False
5  2003  nevada  3.2   False

# INDEX OBJECT

In [54]:
obj=pd.Series(np.arange(3),index=[2,3,5])

In [55]:
obj

2    0
3    1
5    2
dtype: int32

In [56]:
index=obj.index

In [57]:
index

Int64Index([2, 3, 5], dtype='int64')

In [58]:
labels=pd.Index(np.arange(3))

In [59]:
labels

Int64Index([0, 1, 2], dtype='int64')

In [60]:
obj2=pd.Series([1.3,5.67,474],index=labels)

In [61]:
obj2

0      1.30
1      5.67
2    474.00
dtype: float64

In [62]:
obj2.index is labels

True

In [63]:
obj2.reindex([1,2,0,3])

1      5.67
2    474.00
0      1.30
3       NaN
dtype: float64

In [64]:
obj2

0      1.30
1      5.67
2    474.00
dtype: float64